jhillyerd/plugin-git@d6950214b6b2392d3dbb2cb670f2a5f240090038
ilancosman/tide@v6.2.0
jorgebucaran/autopair.fish@1.0.4
gazorby/fish-abbreviation-tips@v0.7.0
fishingline/safe-rm@a9299d6b0bd9053a42c383ffbdbd1b15cb29f074
catppuccin/fish@6a85af2ff722ad0f9fbc8424ea0a5c454661dfed
wburningham/fish-plugin-misc@cb8973d279484421c0e468284f8ece0142fa84fd
meaningful-ooo/sponge@1.1.0
