# === intro ===

# Brew Bundle Docs: https://docs.brew.sh/Brew-Bundle-and-Brewfile
# Declarative package management with a Brewfile: https://matthiasportzel.com/brewfile/

# Example: install from local Formula
# brew "file:///path/to/your/my_formula.rb"
# brew "./my_formula.rb"

# Example: install from head (will use latest commit = slower from building from source)
# brew "package", args: ["HEAD"]

# === base ===
brew "coreutils" # GNU File, Shell, and Text utilities https://www.gnu.org/software/coreutils
# brew "openssh" # We don't want this since it doesn't support macOS UseKeychain in ssh config
brew "ack"
brew "tree"
brew "lsd"
brew "make"
brew "grep"
brew "ripgrep"
brew "vim"
brew "bat"
brew "zoxide"
brew "bash"
brew "fish"
brew "direnv"
brew "fisher"
cask "./casks/fish-theme/fish-theme.rb"

# === misc ===
brew "mosquitto" # for use with HomeAssistant #spellchecker:disable-line
brew "rclone" # Rsync for cloud storage https://rclone.org
brew "zstd" # Zstandard is a real-time compression algorithm https://facebook.github.io/zstd
brew "cloc"
brew "mole"
brew "dsully/tap/macos-defaults"
brew "mcfly" # replaces ctrl-r search w/ CWD+context aware & neural network prioritizing search. https://www.nickyt.co/blog/i-switched-shell-history-tools-heres-why-m6h

# # === dev:git ===
brew "git"
brew "tig" # Text interface for Git repositories https://jonas.github.io/tig
# brew "git-cliff" # Highly customizable changelog generator https://git-cliff.org

# # === dev:golang ===
brew "go"
brew "gofumpt"
brew "gotests"
brew "gopls"
brew "golangci-lint"
brew "orlangure/tap/gocovsh"
# brew "./formula/gocovsh.rb" # Custom because I thought there was no brew formula

# === dev:misc ===
brew "cue-lang/tap/cue"
cask "ghostty@tip"
cask "rio"
brew "gum" # Tool for glamorous shell scripts https://github.com/charmbracelet/gum
brew "go-task"
#brew "./formula/go-task.rb" # pin v3.44.0
brew "watch" # watch -n 10 df -h; Executes a program periodically, showing output fullscreen
brew "wireshark" # Network analyzer and capture tool - w/o GUI https://www.wireshark.org
# brew "act"
brew "eget"
brew "fd" # Simple, fast and user-friendly alternative to find
brew "php"
brew "witr"
brew "rustup"
brew "ruby" # for local homebrew formula
brew "ruby-lsp" # for local homebrew formula
brew "parallel" # Shell command parallelization utility https://savannah.gnu.org/projects/parallel
# tap "tj/mmake", "https://github.com/tj/mmake.git"
# brew "tj/mmake/mmake"
# tap "tldev/tap", "https://github.com/tldev/homebrew-tap.git"
# cask "posturr"

# === dev:http ===
brew "wget"
brew "curl"
brew "curlie"
brew "mkcert" # see https://github.com/FiloSottile/mkcert#macos
brew "nss" # see https://github.com/FiloSottile/mkcert#macos'
brew "serve"

# === dev:node ===
brew "biome"
brew "yarn"
brew "fnm", postinstall: "ln -s ${HOMEBREW_PREFIX}/bin/fnm ${HOMEBREW_PREFIX}/bin/nvm" #CAN'T USE UNTIL ENV SETUP RUNS
brew "pnpm"

# === dev:linting ===
brew "vale"
# brew "hadolint" # Dockerfile linter to validate best practices
brew "ls-lint"
brew "yamllint"
brew "shellcheck"
brew "markdownlint-cli"
brew "typos-cli"
# typos lsp for Sublime Test git commit messages
brew "typos-lsp" # Language Server for typos-cli https://github.com/tekumara/typos-lsp

# === dev:containers/images ===
brew "ko"
brew "apko"
brew "melange"
# brew "cosign"
# brew "cyclonedx-gomod"
# brew "syft"
brew "oras"
# brew "skopeo"
# brew "parlay"
brew "trivy" # Vulnerability scanner for container images, file systems, and Git repos https://trivy.dev
brew "dive" # Tool for exploring each layer in a docker image https://github.com/wagoodman/dive
# brew "podman"

# dev:kubernetes
 brew "kubernetes-helm"
 brew "kubectl"
 brew "kubelogin" # OpenID Connect authentication plugin for kubectl https://github.com/int128/kubelogin
 brew "k9s" # Kubernetes CLI Cluster manager https://k9scli.io

# === image processing ===
brew "imagemagick"

# === data processing ===
brew "jq"
brew "python-yq" # Command-line YAML and XML processor that wraps jq https://kislyuk.github.io/yq
brew "graphviz"

# === dev:ai ===
brew "ollama"
# brew "block-goose-cli"
# cask "block-goose"
cask "cursor"
cask "cursor-cli"
brew "gemini-cli"
cask "claude-code"
# brew "anomalyco/tap/opencode"
cask "codex"

# === passwords ===
cask "1password"
cask "1password-cli"

# === fonts ===
tap "wburningham/fonts", "https://github.com/wburningham/fonts.git"
cask "wburningham/fonts/font-rebecca-handwriting-font"
cask "wburningham/fonts/font-wes-handwriting-font"
cask "./casks/font-maple-mono/font-maple-mono.rb"

# === casks ===
cask "alfred"
cask "./casks/dash.rb" #v3.4.3 locked
cask "disk-inventory-x"
cask "docker-desktop"
cask "hiddenbar"
cask "obsidian"
cask "openlens"
cask "openscad"
cask "rectangle"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "zed"

# === Mac App Store (mas) ===
brew "mas"
mas "Velja", id: 1607635845
mas "AdBlock for Safari", id: 1402042596

# cask "./casks/example-two-files/example-two-files.rb"
# brew "./formula/bom.rb"

# # === work ===
# tap "qdev/homebrew", "https://gitlab-app.eng.qops.net/dev-tooling/devx-cli/homebrew"
# # brew "qdev"
# cask "wizcli"

# # === legacy ===

# tap "bruceadams/utilities"
# tap "encoredev/tap"
# tap "engineering/qualtrics", "https://gitlab-app.eng.qops.net/engineering/homebrew-qualtrics"
# tap "golang/homebrew", "https://gitlab-app.eng.qops.net/golang/homebrew"
# tap "golangci/tap"
# tap "homebrew/bundle"
# tap "homebrew/services"
# tap "jakehilborn/jakehilborn"
# tap "qdev/homebrew", "https://gitlab-app.eng.qops.net/dev-tooling/devx-cli/homebrew"
# tap "qualtrics/brew", "https://gitlab-app.eng.qops.net/homebrew/tap"

# brew "abseil"
# brew "xz"
# brew "libtiff"
# brew "little-cms2"
# brew "webp"
# brew "jpeg-xl"
# brew "aom"
# brew "glib"
# brew "cairo"
# brew "aquasecurity/trivy/trivy"
# brew "engineering/qualtrics/bertha"
# brew "golang/homebrew/closepctickets"
# brew "golang/homebrew/jenkinsfilelint"


# cask "dash"
# cask "discord"
# cask "iterm2" #spellchecker:disable-line
# # cask "kap"
# cask "pgadmin4"
# cask "qlcolorcode"
# cask "qlimagesize"
# cask "qlmarkdown"
# cask "qlstephen"
# cask "quicklook-json"
# cask "zoom"
# vscode "1yib.rust-bundle"
# vscode "aaron-bond.better-comments"
# vscode "albymor.increment-selection"
# vscode "alefragnani.project-manager"
# vscode "anteprimorac.html-end-tag-labels"
# vscode "antyos.openscad"
# vscode "astro-build.astro-vscode"
# vscode "asuka.insertnumbers"
# vscode "bbenoist.nix"
# vscode "be5invis.toml"
# vscode "bierner.markdown-mermaid"
# vscode "bierner.markdown-preview-github-styles"
# vscode "biomejs.biome"
# vscode "bmalehorn.vscode-fish"
# vscode "bmewburn.vscode-intelephense-client"
# vscode "brettm12345.nixfmt-vscode"
# vscode "brody715.txtar"
# vscode "continue.continue"
# vscode "dbaeumer.vscode-eslint"
# vscode "dustypomerleau.rust-syntax"
# vscode "eamodio.gitlens"
# vscode "esbenp.prettier-vscode"
# vscode "gitlab.gitlab-workflow"
# vscode "golang.go"
# vscode "idleberg.applescript"
# vscode "jnoortheen.nix-ide"
# vscode "juliangmp.openscad-formatter"
# vscode "matts966.efm-langserver-vscode"
# vscode "mohammadbaqer.better-folding"
# vscode "mrmlnc.vscode-json5"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-python.vscode-python-envs"
# vscode "ms-vscode.cpptools"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vscode.sublime-keybindings"
# vscode "platformio.platformio-ide"
# vscode "redhat.vscode-yaml"
# vscode "roscop.activefileinstatusbar"
# vscode "rubymaniac.vscode-direnv"
# vscode "rust-lang.rust-analyzer"
# vscode "serayuzgur.crates"
# vscode "sleistner.vscode-fileutils"
# vscode "sourcegraph.cody-ai"
# vscode "tabbyml.vscode-tabby"
# vscode "task.vscode-task"
# vscode "tekumara.typos-vscode"
# vscode "twpayne.vscode-testscript"
# vscode "xdebug.php-debug"
